Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official NUCLEO-F303ZE.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                         |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |SPI4 |USART1|USART2|USART3|ADC1 |TIM (PWM)                                 |USB|RCC       |SYS           
PA0 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN1 |*TIM2_CH1                                 |   |          |              
PA1 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN2 |*TIM2_CH2 *TIM15_CH1N                     |   |          |              
PA2 , // |                                    |    |    |    |     |     |     |     |      |*TX   |      |*IN3 |*TIM2_CH3 +TIM15_CH1                      |   |          |              
PA3 , // |                                    |    |    |    |     |     |     |     |      |*RX   |      |*IN4 |*TIM2_CH4 +TIM15_CH2                      |   |          |              
PA4 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM3_CH2                                 |   |          |              
PA5 , // |                                    |    |    |    |*SCK |     |     |     |      |      |      |     |+TIM2_CH1                                 |   |          |              
PA6 , // |                                    |    |    |    |*MISO|     |     |     |      |      |      |     |+TIM3_CH1 *TIM16_CH1                      |   |          |              
PA7 , // |                                    |    |    |    |*MOSI|     |     |     |      |      |      |     |*TIM8_CH1N +TIM3_CH2 +TIM1_CH1N *TIM17_CH1|   |          |              
PA8 , // |                                    |    |    |*SCL|     |     |     |     |      |      |      |     |+TIM1_CH1                                 |   |          |              
PA9 , // |                                    |    |+SCL|    |     |     |     |     |+TX   |      |      |     |+TIM1_CH2 +TIM2_CH3                       |   |          |              
PA10, // |                                    |    |+SDA|    |     |+MISO|     |     |+RX   |      |      |     |+TIM1_CH3 +TIM2_CH4                       |   |          |              
PA11, // |USB_DM                              |    |    |    |     |+MOSI|     |     |      |      |      |     |+TIM1_CH4 +TIM1_CH1N +TIM4_CH1            |*DM|          |              
PA12, // |USB_DP                              |    |    |    |     |     |     |     |      |      |      |     |+TIM1_CH2N +TIM16_CH1 +TIM4_CH2           |*DP|          |              
PA13, // |TMS                                 |    |    |    |     |     |     |     |      |      |      |     |*TIM16_CH1N +TIM4_CH3                     |   |          |*JTMS-SWDIO   
PA14, // |TCK                                 |*SDA|    |    |     |     |     |     |      |+TX   |      |     |+TIM8_CH2                                 |   |          |*JTCK-SWCLK   
PA15, // |                                    |*SCL|    |    |     |     |     |     |      |+RX   |      |     |+TIM8_CH1 +TIM2_CH1                       |   |          |*JTDI         
PB0 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM8_CH2N +TIM3_CH3 *TIM1_CH2N           |   |          |              
PB1 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM3_CH4 +TIM1_CH3N *TIM8_CH3N           |   |          |              
PB2 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PB3 , // |SWO                                 |    |    |    |+SCK |     |+SCK |     |      |+TX   |      |     |+TIM8_CH1N +TIM2_CH2                      |   |          |*JTDO-TRACESWO
PB4 , // |                                    |    |    |    |+MISO|     |+MISO|     |      |+RX   |      |     |+TIM8_CH2N +TIM3_CH1 +TIM16_CH1           |   |          |*NJTRST       
PB5 , // |                                    |    |    |+SDA|+MOSI|     |+MOSI|     |      |      |      |     |+TIM3_CH2 +TIM8_CH3N +TIM17_CH1           |   |          |              
PB6 , // |                                    |+SCL|    |    |     |     |     |     |+TX   |      |      |     |+TIM8_CH1 +TIM16_CH1N +TIM4_CH1           |   |          |              
PB7 , // |LD2 [Blue]                          |+SDA|    |    |     |     |     |     |+RX   |      |      |     |*TIM17_CH1N +TIM3_CH4 +TIM4_CH2           |   |          |              
PB8 , // |                                    |+SCL|    |    |     |     |     |     |      |      |+RX   |     |+TIM8_CH2 +TIM16_CH1 +TIM4_CH3            |   |          |              
PB9 , // |                                    |+SDA|    |    |     |     |     |     |      |      |+TX   |     |+TIM8_CH3 +TIM17_CH1 +TIM4_CH4            |   |          |              
PB10, // |                                    |    |    |    |     |     |     |     |      |      |*TX   |     |+TIM2_CH3                                 |   |          |              
PB11, // |                                    |    |    |    |     |     |     |     |      |      |+RX   |*IN14|+TIM2_CH4                                 |   |          |              
PB12, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PB13, // |                                    |    |    |    |     |+SCK |     |     |      |      |      |     |+TIM1_CH1N                                |   |          |              
PB14, // |LD3 [Red]                           |    |    |    |     |*MISO|     |     |      |      |      |     |+TIM1_CH2N +TIM15_CH1                     |   |          |              
PB15, // |                                    |    |    |    |     |*MOSI|     |     |      |      |      |     |+TIM1_CH3N +TIM15_CH2 +TIM15_CH1N         |   |          |              
PC0 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN6 |*TIM1_CH1                                 |   |          |              
PC1 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN7 |*TIM1_CH2                                 |   |          |              
PC2 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN8 |*TIM1_CH3                                 |   |          |              
PC3 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN9 |*TIM1_CH4                                 |   |          |              
PC4 , // |                                    |    |    |    |     |     |     |     |*TX   |      |      |     |                                          |   |          |              
PC5 , // |                                    |    |    |    |     |     |     |     |*RX   |      |      |     |                                          |   |          |              
PC6 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM8_CH1 +TIM3_CH1                       |   |          |              
PC7 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM8_CH2 +TIM3_CH2                       |   |          |              
PC8 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM8_CH3 +TIM3_CH3                       |   |          |              
PC9 , // |                                    |    |    |*SDA|     |     |     |     |      |      |      |     |*TIM8_CH4 +TIM3_CH4                       |   |          |              
PC10, // |                                    |    |    |    |     |     |*SCK |     |      |      |+TX   |     |+TIM8_CH1N                                |   |          |              
PC11, // |                                    |    |    |    |     |     |*MISO|     |      |      |+RX   |     |+TIM8_CH2N                                |   |          |              
PC12, // |                                    |    |    |    |     |     |*MOSI|     |      |      |      |     |+TIM8_CH3N                                |   |          |              
PC13, // |Usb_Btn [B1]                        |    |    |    |     |     |     |     |      |      |      |     |*TIM1_CH1N                                |   |          |              
PC14, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |*OSC32_IN |              
PC15, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |*OSC32_OUT|              
PD0 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PD1 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM8_CH4                                 |   |          |              
PD2 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PD3 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM2_CH1                                 |   |          |              
PD4 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM2_CH2                                 |   |          |              
PD5 , // |                                    |    |    |    |     |     |     |     |      |+TX   |      |     |                                          |   |          |              
PD6 , // |                                    |    |    |    |     |     |     |     |      |+RX   |      |     |+TIM2_CH4                                 |   |          |              
PD7 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM2_CH3                                 |   |          |              
PD8 , // |STLK_RX [STM32F103CBT6_PA3]         |    |    |    |     |     |     |     |      |      |+TX   |     |                                          |   |          |              
PD9 , // |STLK_TX [STM32F103CBT6_PA2]         |    |    |    |     |     |     |     |      |      |+RX   |     |                                          |   |          |              
PD10, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PD11, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PD12, // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM4_CH1                                 |   |          |              
PD13, // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM4_CH2                                 |   |          |              
PD14, // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM4_CH3                                 |   |          |              
PD15, // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM4_CH4                                 |   |          |              
PE0 , // |                                    |    |    |    |     |     |     |     |+TX   |      |      |     |+TIM16_CH1                                |   |          |              
PE1 , // |                                    |    |    |    |     |     |     |     |+RX   |      |      |     |+TIM20_CH4 +TIM17_CH1                     |   |          |              
PE2 , // |                                    |    |    |    |     |     |     |*SCK |      |      |      |     |*TIM3_CH1 *TIM20_CH1                      |   |          |*TRACECK      
PE3 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM3_CH2 *TIM20_CH2                      |   |          |*TRACED0      
PE4 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM3_CH3 *TIM20_CH1N                     |   |          |*TRACED1      
PE5 , // |                                    |    |    |    |     |     |     |*MISO|      |      |      |     |*TIM20_CH2N *TIM3_CH4                     |   |          |*TRACED2      
PE6 , // |                                    |    |    |    |     |     |     |*MOSI|      |      |      |     |*TIM20_CH3N                               |   |          |*TRACED3      
PE7 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PE8 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM1_CH1N                                |   |          |              
PE9 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM1_CH1                                 |   |          |              
PE10, // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM1_CH2N                                |   |          |              
PE11, // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM1_CH2                                 |   |          |              
PE12, // |                                    |    |    |    |     |     |     |+SCK |      |      |      |     |+TIM1_CH3N                                |   |          |              
PE13, // |                                    |    |    |    |     |     |     |+MISO|      |      |      |     |+TIM1_CH3                                 |   |          |              
PE14, // |                                    |    |    |    |     |     |     |+MOSI|      |      |      |     |+TIM1_CH4                                 |   |          |              
PE15, // |                                    |    |    |    |     |     |     |     |      |      |*RX   |     |                                          |   |          |              
PF0 , // |MCO [STM32F103CBT6_PA8]             |    |*SDA|    |     |     |     |     |      |      |      |     |*TIM1_CH3N                                |   |*OSC_IN   |              
PF1 , // |                                    |    |+SCL|    |     |+SCK |     |     |      |      |      |     |                                          |   |*OSC_OUT  |              
PF2 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN10|*TIM20_CH3                                |   |          |              
PF3 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |*TIM20_CH4                                |   |          |              
PF4 , // |                                    |    |    |    |     |     |     |     |      |      |      |*IN5 |+TIM20_CH1N                               |   |          |              
PF5 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH2N                               |   |          |              
PF6 , // |                                    |    |*SCL|    |     |     |     |     |      |      |      |     |*TIM4_CH4                                 |   |          |              
PF7 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PF8 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PF9 , // |                                    |    |    |    |     |*SCK |     |     |      |      |      |     |*TIM15_CH1                                |   |          |              
PF10, // |                                    |    |    |    |     |+SCK |     |     |      |      |      |     |*TIM15_CH2                                |   |          |              
PF11, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PF12, // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH1                                |   |          |              
PF13, // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH2                                |   |          |              
PF14, // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH3                                |   |          |              
PF15, // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH4                                |   |          |              
PG0 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH1N                               |   |          |              
PG1 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH2N                               |   |          |              
PG2 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH3N                               |   |          |              
PG3 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG4 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG5 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG6 , // |USB_PowerSwitchOn [STMPS2151STR_EN] |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG7 , // |USB_OverCurrent [STMPS2151STR_FAULT]|    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG8 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG9 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG10, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG11, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG12, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG13, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG14, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PG15, // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
PH0 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH1                                |   |          |              
PH1 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |+TIM20_CH2                                |   |          |              
PH2 , // |                                    |    |    |    |     |     |     |     |      |      |      |     |                                          |   |          |              
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

